docs/bonk-ide.org
#+title: Bonk-ide
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./../core/bonk-ide.el :mkdirp yes

* Provide

#+begin_src emacs-lisp

  (provide 'bonk-ide)

#+end_src

#+RESULTS:
: bonk-ide

* Development
** General configs

   Here is the config for wether using tabs, how to indent, how many spaces, etc.
*** Prog-mode


***** Commenting Lines
#+begin_src emacs-lisp
(setup (:pkg evil-nerd-commenter :straight t)
  (:global "M-/" evilnc-comment-or-uncomment-lines))
#+end_src

#+RESULTS:
: evilnc-comment-or-uncomment-lines

***** Folding with Origami
#+begin_src emacs-lisp
  (setup (:pkg origami :straight t)
	(:disabled)
	(:hook-into c-mode
				emacs-lisp-mode
				go-mode
				yaml-mode))
#+end_src

#+RESULTS:

***** Infer Indent Style

#+begin_src emacs-lisp

  (defun bonk/infer-indent-style ()
	;; Honestly, This is more of a wild guess since we could be using tabs and having it wrongly
	;; configure on our ide
	(let ((space-count (how-many "^ "))
		  (tab-count (how-many "^\t")))
	  (if (> space-count tab-count )
		  (setq indent-tabs-mode nil))
	  (if (> tab-count space-count)
		  (setq indent-tabs-mode t))))

#+end_src

#+RESULTS:
: bonk/infer-indent-style

***** Configuration
   #+begin_src emacs-lisp
	 (defun bonk/prog-mode-settings ()
	   (setq-default tab-width 4) ; I want tabs to be four spaces wide
	   (setq standard-indent 4) ; I want indent to be four spaces wide
	   (show-paren-mode t)
	   (display-line-numbers-mode)
	   (setq whitespace-style '(tab-mark trailing spaces space-mark))
	   (custom-set-faces
		 '(whitespace-tab ((t (:foreground "#636363"))))
		 '(whitespace-space ((t (:foreground "#636363"))))
		 )
	   (setq whitespace-display-mappings '(
										   (tab-mark 9 [9474 9] [92 9])
										   (space-mark 32 [183] [46])))
	   (setq-local show-trailing-whitespace t)
	   (bonk/infer-indent-style)
	   (whitespace-mode))

	 (add-hook 'prog-mode-hook 'bonk/prog-mode-settings)
	 ;; Indentation levels for each lang
	 (defvaralias 'js2-basic-offset 'tabwidth)
	 (defvaralias 'js-indent-level 'tab-width)
	 (defvaralias 'js-indent-level 'tab-width)
	 (defvaralias 'rjsx-indent-level 'tab-width)
	 (defvaralias 'rjsx-mode-markup-indent-offset 'tab-width)
	 (defvaralias 'rjsx-mode-code-indent-offset 'tab-width)
	 (defvaralias 'web-mode-css-indent-offset 'tab-width)
	 (defvaralias 'js2-indent-level 'tab-width)

	 ;; Increase for better lsp-mode performance; see
	 ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
	 (when (boundp 'read-process-output-max)
	   ;; New in Emacs 27
	   (setq read-process-output-max (* 2048 2048))
	   (load-file "~/magit.el"))
   #+end_src

   #+RESULTS:
   : t

** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp

  (setup (:pkg company :straight t)
	(:hook-into prog-mode)
		 (:bind
		  "<tab>" company-complete-selection
		  "<tab>" company-indent-or-complete-common)
		 (setq company-lsp-cache-candidates 'auto)
		 (setq company-minimum-prefix-length 1)
		 (setq company-idle-delay 0.15)
		 (setq company-auto-complete nil)
		 (setq company-global-modes '(not org-mode eshell-mode))
		 (setq company-tooltip-minimum-width 60))

  (global-company-mode t)
  (setup (:pkg all-the-icons-completion :straight t))


#+end_src

#+RESULTS:
: t

*** Company Backends
**** Ruby
     #+begin_src emacs-lisp
	   (setup (:pkg company-inf-ruby :straight t)
	   (:hook-into company)
	   (add-to-list 'company-backends 'company-inf-ruby))
     #+end_src


	 #+RESULTS:
	 | company-robe | company-inf-ruby | company-bbdb | company-semantic | company-cmake | company-capf | company-clang | company-files | (company-dabbrev-code company-gtags company-etags company-keywords) | company-oddmuse | company-dabbrev |
	 
** Languages
*** LSP
**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp


  (defun bonk/lsp-mode-setup ()
	  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
	  (lsp-headerline-breadcrumb-mode))

  (setup (:pkg lsp-mode :straight t)
	(:disabled)
		   (:hook bonk/lsp-mode-setup )
		   (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
		   (:option lsp-enable-which-key-integration t)
		   (setq lsp-completion-enable t)
		   (:when-loaded
		  (progn
			  (setq lsp-language-id-configuration '((java-mode . "java")
												  (kotlin-mode . "kotlin")
												  (python-mode . "python")
												  (gfm-view-mode . "markdown")
												  (css-mode . "css")
												  (xml-mode . "xml")
												  (c-mode . "c")
												  (dart-mode . "dart")
												  (c++-mode . "cpp")
												  ;; (rustic-mode . "rust")
												  (objc-mode . "objective-c")
												  (web-mode . "html")
												  (html-mode . "html")
												  (sgml-mode . "html")
												  (mhtml-mode . "html")
												  (go-mode . "go")
												  (haskell-mode . "haskell")
												  (php-mode . "php")
												  (json-mode . "json")
												  (typescript-mode . "typescript")
												  (rjsx-mode . "javascript")
												  ))

			  (setq lsp-diagnostics-provider :none)

			  (:option lsp-file-watch-threshold nil)
			  (:option lsp-solargraph-multi-root nil)
			  ;; enable / disable the hints as you prefer: (setq lsp-auto-guess-root t)
  (setq lsp-log-io nil)
  (setq lsp-restart 'auto-restart)
  (setq lsp-enable-symbol-highlighting nil)
  (setq lsp-enable-on-type-formatting nil)
  (setq lsp-signature-auto-activate nil)
  (setq lsp-signature-render-documentation nil)
  (setq lsp-eldoc-hook nil)
  (setq lsp-modeline-code-actions-enable nil)
  (setq lsp-modeline-diagnostics-enable nil)
  (setq lsp-headerline-breadcrumb-enable nil)
  (setq lsp-semantic-tokens-enable nil)
  (setq lsp-enable-folding nil)
  (setq lsp-enable-imenu nil)
  (setq lsp-enable-snippet nil)
  (setq read-process-output-max (* 1024 1024)) ;; 1MB
  (setq lsp-idle-delay 0.5)
			  )))
#+end_src

#+RESULTS:

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more
like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning
of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

  (setup (:pkg lsp-ui :straight t)
	(:disabled)
		 (:hook-into lsp-mode)
		 (:when-loaded
		  (progn
			(setq lsp-ui-sideline-enable t)
			(setq lsp-ui-sideline-show-hover nil)
			(setq lsp-ui-doc-enable t)
			(setq lsp-ui-doc-position 'bottom))))

#+end_src

#+RESULTS:

**** lsp-ivy

[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp

  (setup (:pkg lsp-ivy :straight t)
	(:disabled)
	(:load-after lsp-mode))

#+end_src

#+RESULTS:

