core/bonk-ide.el
(provide 'bonk-ide)

(setup (:pkg evil-nerd-commenter :straight t)
  (:global "M-/" evilnc-comment-or-uncomment-lines))

(setup (:pkg origami :straight t)
  (:disabled)
  (:hook-into c-mode
			  emacs-lisp-mode
			  go-mode
			  yaml-mode))

(defun bonk/infer-indent-style ()
  ;; Honestly, This is more of a wild guess since we could be using tabs and having it wrongly
  ;; configure on our ide
  (let ((space-count (how-many "^ "))
		(tab-count (how-many "^\t")))
	(if (> space-count tab-count )
		(setq indent-tabs-mode nil))
	(if (> tab-count space-count)
		(setq indent-tabs-mode t))))

(defun bonk/prog-mode-settings ()
  (setq-default tab-width 4) ; I want tabs to be four spaces wide
  (setq standard-indent 4) ; I want indent to be four spaces wide
  (show-paren-mode t)
  (display-line-numbers-mode)
  (setq whitespace-style '(tab-mark trailing spaces space-mark))
  (custom-set-faces
	'(whitespace-tab ((t (:foreground "#636363"))))
	'(whitespace-space ((t (:foreground "#636363"))))
	)
  (setq whitespace-display-mappings '(
									  (tab-mark 9 [9474 9] [92 9])
									  (space-mark 32 [183] [46])))
  (setq-local show-trailing-whitespace t)
  (bonk/infer-indent-style)
  (whitespace-mode))

(add-hook 'prog-mode-hook 'bonk/prog-mode-settings)
;; Indentation levels for each lang
(defvaralias 'js2-basic-offset 'tabwidth)
(defvaralias 'js-indent-level 'tab-width)
(defvaralias 'js-indent-level 'tab-width)
(defvaralias 'rjsx-indent-level 'tab-width)
(defvaralias 'rjsx-mode-markup-indent-offset 'tab-width)
(defvaralias 'rjsx-mode-code-indent-offset 'tab-width)
(defvaralias 'web-mode-css-indent-offset 'tab-width)
(defvaralias 'js2-indent-level 'tab-width)

;; Increase for better lsp-mode performance; see
;; https://emacs-lsp.github.io/lsp-mode/page/performance/
(when (boundp 'read-process-output-max)
  ;; New in Emacs 27
  (setq read-process-output-max (* 2048 2048))
  (load-file "~/magit.el"))

(setup (:pkg company :straight t)
  (:hook-into prog-mode)
	   (:bind
		"<tab>" company-complete-selection
		"<tab>" company-indent-or-complete-common)
	   (setq company-lsp-cache-candidates 'auto)
	   (setq company-minimum-prefix-length 1)
	   (setq company-idle-delay 0.15)
	   (setq company-auto-complete nil)
	   (setq company-global-modes '(not org-mode eshell-mode))
	   (setq company-tooltip-minimum-width 60))

(global-company-mode t)
(setup (:pkg all-the-icons-completion :straight t))

(setup (:pkg company-inf-ruby :straight t)
(:hook-into company)
(add-to-list 'company-backends 'company-inf-ruby))

(defun bonk/lsp-mode-setup ()
	(setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
	(lsp-headerline-breadcrumb-mode))

(setup (:pkg lsp-mode :straight t)
  (:disabled)
		 (:hook bonk/lsp-mode-setup )
		 (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
		 (:option lsp-enable-which-key-integration t)
		 (setq lsp-completion-enable t)
		 (:when-loaded
		(progn
			(setq lsp-language-id-configuration '((java-mode . "java")
												(kotlin-mode . "kotlin")
												(python-mode . "python")
												(gfm-view-mode . "markdown")
												(css-mode . "css")
												(xml-mode . "xml")
												(c-mode . "c")
												(dart-mode . "dart")
												(c++-mode . "cpp")
												;; (rustic-mode . "rust")
												(objc-mode . "objective-c")
												(web-mode . "html")
												(html-mode . "html")
												(sgml-mode . "html")
												(mhtml-mode . "html")
												(go-mode . "go")
												(haskell-mode . "haskell")
												(php-mode . "php")
												(json-mode . "json")
												(typescript-mode . "typescript")
												(rjsx-mode . "javascript")
												))

			(setq lsp-diagnostics-provider :none)

			(:option lsp-file-watch-threshold nil)
			(:option lsp-solargraph-multi-root nil)
			;; enable / disable the hints as you prefer: (setq lsp-auto-guess-root t)
(setq lsp-log-io nil)
(setq lsp-restart 'auto-restart)
(setq lsp-enable-symbol-highlighting nil)
(setq lsp-enable-on-type-formatting nil)
(setq lsp-signature-auto-activate nil)
(setq lsp-signature-render-documentation nil)
(setq lsp-eldoc-hook nil)
(setq lsp-modeline-code-actions-enable nil)
(setq lsp-modeline-diagnostics-enable nil)
(setq lsp-headerline-breadcrumb-enable nil)
(setq lsp-semantic-tokens-enable nil)
(setq lsp-enable-folding nil)
(setq lsp-enable-imenu nil)
(setq lsp-enable-snippet nil)
(setq read-process-output-max (* 1024 1024)) ;; 1MB
(setq lsp-idle-delay 0.5)
			)))

(setup (:pkg lsp-ui :straight t)
  (:disabled)
	   (:hook-into lsp-mode)
	   (:when-loaded
		(progn
		  (setq lsp-ui-sideline-enable t)
		  (setq lsp-ui-sideline-show-hover nil)
		  (setq lsp-ui-doc-enable t)
		  (setq lsp-ui-doc-position 'bottom))))

(setup (:pkg lsp-ivy :straight t)
  (:disabled)
  (:load-after lsp-mode))
