docs/bonk-ide.org
*** TODO Eglot
#+begin_src emacs-lisp
		(setup (:pkg eglot :straight t)
			   :ensure t)
	;;  hooks
		(defun bonk-ide--add-eglot-hooks (mode-list)
		  "Iterates over MODE-LIST recursively to add eglot-ensure to
		existing mode hooks.

		The mode must be loaded, ie. found with `fboundp'. A mode which
		is not loaded will not have a hook added, in which case add it
		manually with something like this:

		`(add-hook 'some-mode-hook #'eglot-ensure)'
		"
		  (dolist (mode-def mode-list)
			(let ((mode (if (listp mode-def) (car mode-def) mode-def)))
			  (cond
			   ((listp mode) (bonk-ide--add-eglot-hooks mode))
			   (t
				(when (and (fboundp mode)
						   (not (eq 'clojure-mode mode))  ; prefer cider
						   (not (eq 'lisp-mode mode))     ; prefer sly/slime
						   (not (eq 'scheme-mode mode))   ; prefer geiser
						   )
				  (let ((hook-name (concat (symbol-name mode) "-hook")))
					(message (concat "adding eglot to " hook-name))
					(add-hook (intern hook-name) #'eglot-ensure))))))))

	;; add eglot to existing programming modes when eglot is loaded.
	(with-eval-after-load "eglot"
		(bonk-ide--add-eglot-hooks eglot-server-programs)

  (add-to-list 'eglot-server-programs
			   '((ruby-mode) "solargraph" "stdio"))
  )
		;;; customization
		;; Shutdown server when last managed buffer is killed
		(customize-set-variable 'eglot-autoshutdown t)
	(customize-set-variable 'eglot-send t)
#+end_src

#+RESULTS:
: t

*** Treesitter
#+begin_src emacs-lisp
	(setup (:pkg tree-sitter :straight t)
	  (:hook tree-sitter-hl-mode)
	  (:hook-into typescript-mode))
	(setup (:pkg tree-sitter-langs :straight t))
#+end_src

#+RESULTS:

*** Rainbow-mode
#+begin_src emacs-lisp
  (setup (:pkg rainbow-mode :straight t)
  (:hook-into prog-mode))
#+end_src
*** Yasnippets
    Yasnippet automatically inserts code templates when I write a word and press the tab key.
    It predefines most of the common templates, including the dreadful =if err !\=nil { ....=

    #+begin_src emacs-lisp

			  (setup (:pkg yasnippet :straight t)                  ; Snippets
				(yas-global-mode 1))

				(with-eval-after-load 'yasnippet
				 (setq yas-snippt-dirs '(yasnippet-snippets-dir))
				(setq
				 yas-verbosity 1                      ; No need to be so verbose
				 yas-wrap-around-region t)
				(add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets")
				(yas-reload-all))


			  (setup (:pkg yasnippet-snippets :straight t)         ; Collection of snippets
				(:load-after yasnippet))
    #+end_src

	#+RESULTS:
	: yasnippet-snippets

*** Flycheck

    Flycheck is one of the two main packages for code checks in the background. The
    other one is Flymake. I use Flycheck because it allows me to define a custom “advanced”
    checker.
    #+begin_src emacs-lisp

	  (setup (:pkg flycheck :straight t)
		(:hook-into company-mode )
		(setq flycheck-check-syntax-automatically `(idle-change mode-enabled))
		(setq flycheck-idle-change-delay 4)
		(setq flycheck-disabled-checkers
			  '(ruby ruby-reek
					 ruby-standard
					 ;; ruby-rubocop
					 ruby-rubylint
					 yaml-ruby)))

	#+end_src

	#+RESULTS:
	| ruby | ruby-reek | ruby-standard | ruby-rubylint | yaml-ruby |

*** Python
#+begin_src emacs-lisp
	  (add-hook 'python-mode-hook 'flycheck-mode)

	  (with-eval-after-load 'company
		(add-hook 'python-mode-hook 'company-mode))

	  (setup (:pkg company-jedi :straight t)
		(:when-loaded
		  (progn
			(add-to-list 'company-backends 'company-jedi))))

	  (defun python-mode-company-init ()
		(setq-local company-backends '((company-jedi
										company-etags
										company-dabbrev-code))))
	(setup (:pkg python-mode :straight t)
	  (:hook tree-sitter-mode)
	  (:hook eglot-ensure)
	  (:when-loaded
		(progn
		  (setq indent-tabs-mode nil)
		  (setq python-indent-guess-indent-offset t)
		  )))

	  (with-eval-after-load 'python-mode
		(lambda () (require 'lsp-pyright)))
	(setup (:pkg lsp-pyright :straight t)
	  (:when-loaded
		(progn
		  (when (executable-find "python3")
			(setq lsp-pyright-python-executable-cmd "python3")))))
	(setup (:pkg pyenv :straight t)
	  (:load-after python-mode))

#+end_src

#+RESULTS:

*** Ruby
**** ruby-mode
     #+begin_src emacs-lisp
	   (setup ruby-mode
		(:file-match "\\.rb\\'")
		(:hook eglot-ensure)
		(:hook tree-sitter-mode)
		(setq ruby-indent-level 4)
		 (setq ruby-indent-tabs-mode t)
		 )


     #+end_src

	 #+RESULTS:
	 : t

**** robe-mode
     #+begin_src emacs-lisp
					 (setup (:pkg robe-mode :straight t)
					   (:hook-into ruby-mode))
					 (eval-after-load 'company
					   '(push 'company-robe company-backends))
     #+end_src

     #+RESULTS:

**** rspec-mode
     #+begin_src emacs-lisp
			  (setup (:pkg rspec-mode :straight t)
				(:hook-into ruby-mode))
     #+end_src

     #+RESULTS:
     : t

*** Golang
    
    #+begin_src emacs-lisp
			(setup (:pkg go-mode :straight t)
			  (:file-match "\\.go\\'")
			  (:hook tree-sitter-mode)
			  (:hook eglot-ensure)
			  (add-hook 'go-mode-hook (lambda ()
										(setq tab-width 4)))
			  (add-hook 'go-mode-hook #'lsp)
			  (add-hook 'before-save-hook 'gofmt-before-save)
			  (defun lsp-go-install-save-hooks ()
				(add-hook 'before-save-hook 'lsp-format-buffer t t)
				(add-hook 'before-save-hook 'lsp-organize-imports t t))
			  (add-hook 'go-mode-hook 'lsp-go-install-save-hooks))

    #+end_src

	#+RESULTS:
	| tree-sitter-mode | doom-modeline-env-setup-go | lsp-go-install-save-hooks | lsp | (lambda nil (setq tab-width 4)) | eglot-ensure |
	
	
*** RJSX
#+begin_src emacs-lisp
	(setup (:pkg rjsx-mode :straight t)
		(:file-match "\\.js\\' \\.jsx?\\' \\.tsx\\'")
		(:hook tree-sitter-hl-mode)
		(setq indent-tabs-mode 0)
		(setq js2-basic-offset 2))

	(setup (:pkg prettier-js))
#+end_src

#+RESULTS:
| emacs-vhdl-mode | emacs-prettier-js | emacs-org-present | emacs-guix |

*** TypeScript and JavaScript

Configure TypeScript and JavaScript language modes

#+begin_src emacs-lisp

  (setup (:pkg typescript-mode :straight t)
	(:hook tree-sitter-hl-mode)
	(:hook eglot-ensure)
	(:hook tide-setup)
	(:hook tide-hl-identifier-mode)
	)

  (setup (:pkg tide :straight t)
	(setq flycheck-check-syntax-automatically '(save mode-enabled))
	(:load-after typescript-mode company-mode flycheck-mode))

  (setup (:pkg js2-mode :straight t)
	;; Use js2-mode for Node scripts
	(add-to-list 'magic-mode-alist '("#!/usr/bin/env node" . js2-mode))

	;; Don't use built-in syntax checking
	(setq js2-mode-show-strict-warnings nil))



#+end_src

#+RESULTS:

*** Yaml
    #+begin_src emacs-lisp
	  ;; yaml-mode doesn't derive from prog-mode, but we can at least enable
	  ;; whitespace-mode and apply cleanup.
	  (setup (:pkg yaml-mode :straight t)
			 (:file-match "\\.ya?ml\\'")
			 (add-hook 'yaml-mode-hook 'whitespace-mode)
			 (add-hook 'yaml-mode-hook 'subword-mode))

    #+end_src

*** Lispy-languages

#+begin_src emacs-lisp

  (setup (:pkg lispy :straight t)
    (:hook-into emacs-lisp-mode scheme-mode lisp-mode))

  (setup (:pkg lispyville :straight t)
    (:hook-into lispy-mode)
    (:when-loaded
      (lispyville-set-key-theme '(operators c-w additional
                                  additional-movement slurp/barf-cp
                                  prettify))))

#+end_src

#+RESULTS:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-lispy"
  "emacs-lispyville"

#+end_src

**** Common Lisp

#+begin_src emacs-lisp
  (setup common-lisp-mode
	(:file-match "\\.lisp\\'")
	(:hook eglot-ensure))

  (setup (:pkg sly :straight t)
	(:load-after common-lisp-mode)
	:options
	 (setq sly-lisp-implementations
		   '((sbcl ("/usr/bin/sbcl")))))


#+end_src

#+RESULTS:
| sbcl | (/usr/bin/sbcl) |

**** Emacs Lisp

#+begin_src emacs-lisp

	(setup emacs-lisp-mode
	  (:hook flycheck-mode)
	  (:hook eglot-ensure)
	  )
	(setup (:pkg json-rpc :straight t))
	(setup (:pkg json-rpc-server :straight t)
	  :ensure t)

	(setup (:pkg helpful :straight t)
	  (:option counsel-describe-function-function #'helpful-callable
			   counsel-describe-variable-function #'helpful-variable)
	  (:global [remap describe-function] helpful-function
			   [remap describe-symbol] helpful-symbol
			   [remap describe-variable] helpful-variable
			   [remap describe-command] helpful-command
			   [remap describe-key] helpful-key))

	(bonk/leader-keys
	  "e"   '(:ignore t :which-key "eval")
	  "eb"  '(eval-buffer :which-key "eval buffer"))

	(bonk/leader-keys
	  :keymaps '(visual)
	  "er" '(eval-region :which-key "eval region"))

#+end_src

#+RESULTS:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-helpful"

#+end_src


