docs/bonk-ide.org
**** Scheme

#+begin_src emacs-lisp

  ;; TODO: This causes issues for some reason.
  ;; :bind (:map geiser-mode-map
  ;;        ("TAB" . completion-at-point))

  (setup scheme-mode
	(:hook geiser-mode)
	(:hook tree-sitter-mode))
  (setup (:pkg geiser :straight t)
	;; (setq geiser-default-implementation 'gambit)
	;; (setq geiser-active-implementations '(gambit guile))
	;; (setq geiser-implementations-alist '(((regexp "\\.scm$") gambit)
	;;                                      ((regexp "\\.sld") gambit)))
	;; (setq geiser-repl-default-port 44555) ; For Gambit Scheme
	(setq geiser-default-implementation 'guile)
	(setq geiser-active-implementations '(guile))
	(setq geiser-repl-default-port 44555) ; For Gambit Scheme
	(setq geiser-implementations-alist '(((regexp "\\.scm$") guile))))

#+end_src

#+RESULTS:
| (regexp \.scm$) | guile |

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-geiser"

#+end_src


I was going to put clojure here, but you see, it runs on the JVM, so...

*** JVM-Langs
Apparently James Gosling used and likes Emacs (nice)
**** Java

#+begin_src emacs-lisp
  (setup (:pkg lsp-java :straight t)
	(:disabled)
	(:hook-into lsp-mode))
  (setup java-mode
	(:hook tree-sitter-hl-mode)
	(:hook copilot-mode)
	(:hook eglot-ensure))
#+end_src

#+RESULTS:
| eglot-ensure |

**** Clojure
#+begin_src emacs-lisp
  (setup (:pkg clojure-mode :straight t)
		(:hook copilot-mode)
		(:hook tree-sitter-hl-mode))
  (setup (:pkg cider :straight t)
	(:when-loaded
	  (progn
		;; eldoc in cider mode
		(add-hook 'cider-mode-hook 'cider-turn-on-eldoc-mode)
		(add-hook 'cider-mode-hook '(paredit-mode +1))
		(with-eval-after-load 'evil
		  (defun my-evil-cider-repl-insert ()
			"Enter insert mode at the prompt, If we 're behind the prompt."
			(interactive)
			(if (> cider-repl-input-start-mark (point))
				(goto-char cider-repl-input-start-mark))
			(evil-insert-state))
		  ))))

#+end_src

#+RESULTS:

**** Kotlin
#+begin_src emacs-lisp
  (setup (:pkg kotlin-mode :straight t)
	(:hook tree-sitter-hl-mode)
	(:hook copilot-mode)
	(:hook eglot-ensure)
	)
#+end_src

**** Graddle
#+begin_src emacs-lisp
  (setup (:pkg gradle-mode :straight t))
#+end_src

#+RESULTS:
: t

*** C/C++

#+begin_src emacs-lisp

  (setup c-mode
		(:hook tree-sitter-mode)
	(:hook copilot-mode)
		 (:hook eglot-ensure))

  (setup c++-mode
		(:hook tree-sitter-mode)
	(:hook copilot-mode)
		 (:hook eglot-ensure))

  (setup (:pkg flycheck-clang-analyzer :straight t)
	(:hook-into flycheck)
	(:when-loaded
	  (progn
	  (flycheck-clang-analyzer-setup))))

  (with-eval-after-load 'company
	(add-hook 'c++-mode-hook 'company-mode)
	(add-hook 'c-mode-hook 'company-mode))

  (setup (:pkg company-irony :straight t)
	(:when-loaded
	  (progn
	(setq company-backends '((
							  company-dabbrev-code
							  company-irony))))))

  (setup (:pkg irony :straight t)
	(:hook-into c++-mode c-mode)
	(:hook irony-cdb-autosetup-compile-options))

#+end_src 

#+RESULTS:
| irony-cdb-autosetup-compile-options |

*** Verilog / FPGA
#+begin_src emacs-lisp
  (setup (:pkg verilog-mode :straight t))
(setup (:pkg vhdl-mode))
#+end_src

#+RESULTS:
| emacs-vhdl-mode | emacs-python-mode | emacs-org-present | emacs-guix |

*** Zig

#+begin_src emacs-lisp

  (setup (:pkg zig-mode :straight t)
	(:disabled)
	(:hook eglot-ensure))

#+end_src

#+RESULTS:

*** Rust
**** Rustic
rustic is an extension of rust-mode which adds a number of useful features (see the its github readme) to it. It is the core of the setup and you can use just it without any other Emacs packages (and without rust-analyzer) if you just want code highlighting, compilation and cargo commands bound to emacs shortcuts, and a few other features.
#+begin_src emacs-lisp
  (setup (:pkg rustic :straight t)
	(:hook copilot-mode)
	(:hook tree-sitter-mode)
	(:with-map rustic-mode-map
	  (:bind "C-c C-c l"  flycheck-list-errors
			  ))
	:config
	(setq rustic-rustfmt-config-alist '((edition . "2018")))
	;; uncomment for less flashiness
	(setq rustic-lsp-client 'eglot)
	(setq rustic-format-on-save t))

#+end_src

#+RESULTS:
: t

*** Markdown

#+begin_src emacs-lisp

  (setup (:pkg markdown-mode :straight t)
    (setq markdown-command "marked")
    (:file-match "\\.md\\'")
    (:when-loaded
      (dolist (face '((markdown-header-face-1 . 1.2)
                      (markdown-header-face-2 . 1.1)
                      (markdown-header-face-3 . 1.0)
                      (markdown-header-face-4 . 1.0)
                      (markdown-header-face-5 . 1.0)))
        (set-face-attribute (car face) nil :weight 'normal :height (cdr face)))))

#+end_src

#+RESULTS:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-markdown-mode"

#+end_src

*** HTML

#+begin_src emacs-lisp

  (setup web-mode
    (:file-match "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'")
    (setq-default web-mode-code-indent-offset 2)
    (setq-default web-mode-markup-indent-offset 2)
    (setq-default web-mode-attribute-indent-offset 2))

  ;; 1. Start the server with `httpd-start'
  ;; 2. Use `impatient-mode' on any buffer
  (setup (:pkg impatient-mode :straight t))
  (setup (:pkg skewer-mode :straight t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-web-mode"

#+end_src
*** Dart
#+begin_src emacs-lisp
  (setup (:pkg dart-mode :straight t)
		(:hook tree-sitter-hl-mode)
		(:hook copilot-mode)
		)
  (use-package lsp-dart
	:straight t
	:ensure t
	:hook (dart-mode . lsp))
#+end_src

#+RESULTS:
| copilot-mode | tree-sitter-hl-mode | lsp |

** Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp

  (setup (:pkg rainbow-delimiters :straight t)
	   (:hook-into
		org-mode
		prog-mode))

#+end_src

** Smartparens
#+begin_src emacs-lisp

  (setup (:pkg smartparens :straight t)
    (:hook-into prog-mode))

#+end_src
** Electric indent

#+begin_src emacs-lisp
;; Making electric-indent behave sanely
(setq-default electric-indent-inhibit t)

#+end_src 
** Copilot
#+begin_src emacs-lisp
  (use-package copilot
	:straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
	:ensure t)
  ;; you can utilize :map :hook and :config to customize copilot
(define-key copilot-completion-map (kbd "TAB") 'copilot-accept-completion)
#+end_src

#+RESULTS:
: copilot-accept-completion

* DevOops
** Docker

#+begin_src emacs-lisp

  (setup (:pkg docker :straight t)
		 (:hook tree-sitter-mode)
    (:also-load docker-tramp))

  (setup (:pkg docker-tramp :straight t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-docker"
  "emacs-docker-tramp"
  "emacs-dockerfile-mode"

#+end_src

** Terraform
#+begin_src emacs-lisp
  (setup (:pkg terraform-mode :straight t)
		 (:file-match "\\.tf\\'")
		 (:hook tree-sitter-mode)
		(:hook eglot-ensure))

  (setup (:pkg company-terraform :straight t))

  (setup (:pkg terraform-doc :straight t))
#+end_src
* Data-Sci

** Useful packages

Some useful packages to have for datascience are the following:

#+begin_src emacs-lisp

(setup (:pkg csv :straight t))
(setup (:pkg pandoc :straight t))
(setup (:pkg org-preview-html :straight t))
#+end_src 

#+RESULTS:
: t

** ESS (Emacs Speaks Statistics)
#+begin_src emacs-lisp
	  ; Set up ESS, i.e. Statistics in Emacs, R, Stata, etc.
	(setup (:pkg ess :straight t)
	  :defer t
		(:hook tree-sitter-mode)
	  )
	(setup (:pkg ess-view :straight t)
	  :defer t)
	(setup (:pkg ess-view-data :straight t)
	  :defer t)
	(setup (:pkg ess-r-insert-obj :straight t)
	  :defer t)
  (setup (:pkg ess-R-data-view :straight t)
	:defer t)
  (setup (:pkg ess-smart-underscore :straight t)
	:defer t)
#+end_src

#+RESULTS:
: t
** Python
*** DONE ob-Ipython / EIN
#+begin_src emacs-lisp
  (setup (:pkg ein :straight t))
  (setup (:pkg math-preview :straight t))
  (setup (:pkg ipython-shell-send :straight t))
#+end_src 

#+RESULTS:
: t

*** Anaconda
If you were using Jupyter Lab or Notebook before, there is a good chance you
install it via Anaconda. If not, in a nutshell, it is a package & environment
manager, which specializes in Python & R, but also supports a whole lot of stuff
like Node.js. In my opinion, it is the easiest way to manage multiple Python
installations if you don’t use some advanced package manager like Guix.
#+begin_src emacs-lisp
(setup (:pkg conda :straight t)
  :options
  (setq conda-anaconda-home (expand-file-name "~/anaconda3/"))
  (setq conda-env-home-directory (expand-file-name "~/anaconda3/"))
  (setq conda-env-subdirectory "envs"))

(unless (getenv "CONDA_DEFAULT_ENV")
  (conda-env-activate "base"))
#+end_src 

#+RESULTS:


* Ebuilds
#+begin_src emacs-lisp
(setup (:pkg ebuild-mode :straight t))
#+end_src

#+RESULTS:
: t
