core/bonk-ide.el

;; TODO: This causes issues for some reason.
;; :bind (:map geiser-mode-map
;;        ("TAB" . completion-at-point))

(setup scheme-mode
  (:hook geiser-mode)
  (:hook tree-sitter-mode))
(setup (:pkg geiser :straight t)
  ;; (setq geiser-default-implementation 'gambit)
  ;; (setq geiser-active-implementations '(gambit guile))
  ;; (setq geiser-implementations-alist '(((regexp "\\.scm$") gambit)
  ;;                                      ((regexp "\\.sld") gambit)))
  ;; (setq geiser-repl-default-port 44555) ; For Gambit Scheme
  (setq geiser-default-implementation 'guile)
  (setq geiser-active-implementations '(guile))
  (setq geiser-repl-default-port 44555) ; For Gambit Scheme
  (setq geiser-implementations-alist '(((regexp "\\.scm$") guile))))

(setup (:pkg lsp-java :straight t)
  (:disabled)
  (:hook-into lsp-mode))
(setup java-mode
  (:hook tree-sitter-hl-mode)
  (:hook copilot-mode)
  (:hook eglot-ensure))

(setup (:pkg clojure-mode :straight t)
	  (:hook copilot-mode)
	  (:hook tree-sitter-hl-mode))
(setup (:pkg cider :straight t)
  (:when-loaded
	(progn
	  ;; eldoc in cider mode
	  (add-hook 'cider-mode-hook 'cider-turn-on-eldoc-mode)
	  (add-hook 'cider-mode-hook '(paredit-mode +1))
	  (with-eval-after-load 'evil
		(defun my-evil-cider-repl-insert ()
		  "Enter insert mode at the prompt, If we 're behind the prompt."
		  (interactive)
		  (if (> cider-repl-input-start-mark (point))
			  (goto-char cider-repl-input-start-mark))
		  (evil-insert-state))
		))))

(setup (:pkg kotlin-mode :straight t)
  (:hook tree-sitter-hl-mode)
  (:hook copilot-mode)
  (:hook eglot-ensure)
  )

(setup (:pkg gradle-mode :straight t))

(setup c-mode
	  (:hook tree-sitter-mode)
  (:hook copilot-mode)
	   (:hook eglot-ensure))

(setup c++-mode
	  (:hook tree-sitter-mode)
  (:hook copilot-mode)
	   (:hook eglot-ensure))

(setup (:pkg flycheck-clang-analyzer :straight t)
  (:hook-into flycheck)
  (:when-loaded
	(progn
	(flycheck-clang-analyzer-setup))))

(with-eval-after-load 'company
  (add-hook 'c++-mode-hook 'company-mode)
  (add-hook 'c-mode-hook 'company-mode))

(setup (:pkg company-irony :straight t)
  (:when-loaded
	(progn
  (setq company-backends '((
							company-dabbrev-code
							company-irony))))))

(setup (:pkg irony :straight t)
  (:hook-into c++-mode c-mode)
  (:hook irony-cdb-autosetup-compile-options))

(setup (:pkg verilog-mode :straight t))
(setup (:pkg vhdl-mode))

(setup (:pkg zig-mode :straight t)
  (:disabled)
  (:hook eglot-ensure))

(setup (:pkg rustic :straight t)
  (:hook copilot-mode)
  (:hook tree-sitter-mode)
  (:with-map rustic-mode-map
	(:bind "C-c C-c l"  flycheck-list-errors
			))
  :config
  (setq rustic-rustfmt-config-alist '((edition . "2018")))
  ;; uncomment for less flashiness
  (setq rustic-lsp-client 'eglot)
  (setq rustic-format-on-save t))

(setup (:pkg markdown-mode :straight t)
  (setq markdown-command "marked")
  (:file-match "\\.md\\'")
  (:when-loaded
    (dolist (face '((markdown-header-face-1 . 1.2)
                    (markdown-header-face-2 . 1.1)
                    (markdown-header-face-3 . 1.0)
                    (markdown-header-face-4 . 1.0)
                    (markdown-header-face-5 . 1.0)))
      (set-face-attribute (car face) nil :weight 'normal :height (cdr face)))))

(setup web-mode
  (:file-match "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'")
  (setq-default web-mode-code-indent-offset 2)
  (setq-default web-mode-markup-indent-offset 2)
  (setq-default web-mode-attribute-indent-offset 2))

;; 1. Start the server with `httpd-start'
;; 2. Use `impatient-mode' on any buffer
(setup (:pkg impatient-mode :straight t))
(setup (:pkg skewer-mode :straight t))

(setup (:pkg dart-mode :straight t)
	  (:hook tree-sitter-hl-mode)
	  (:hook copilot-mode)
	  )
(use-package lsp-dart
  :straight t
  :ensure t
  :hook (dart-mode . lsp))

(setup (:pkg rainbow-delimiters :straight t)
	 (:hook-into
	  org-mode
	  prog-mode))

(setup (:pkg smartparens :straight t)
  (:hook-into prog-mode))

;; Making electric-indent behave sanely
(setq-default electric-indent-inhibit t)

(use-package copilot
	:straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
	:ensure t)
  ;; you can utilize :map :hook and :config to customize copilot
(define-key copilot-completion-map (kbd "TAB") 'copilot-accept-completion)

(setup (:pkg docker :straight t)
	   (:hook tree-sitter-mode)
  (:also-load docker-tramp))

(setup (:pkg docker-tramp :straight t))

(setup (:pkg terraform-mode :straight t)
	   (:file-match "\\.tf\\'")
	   (:hook tree-sitter-mode)
	  (:hook eglot-ensure))

(setup (:pkg company-terraform :straight t))

(setup (:pkg terraform-doc :straight t))

(setup (:pkg csv :straight t))
(setup (:pkg pandoc :straight t))
(setup (:pkg org-preview-html :straight t))

; Set up ESS, i.e. Statistics in Emacs, R, Stata, etc.
  (setup (:pkg ess :straight t)
	:defer t
	  (:hook tree-sitter-mode)
	)
  (setup (:pkg ess-view :straight t)
	:defer t)
  (setup (:pkg ess-view-data :straight t)
	:defer t)
  (setup (:pkg ess-r-insert-obj :straight t)
	:defer t)
(setup (:pkg ess-R-data-view :straight t)
  :defer t)
(setup (:pkg ess-smart-underscore :straight t)
  :defer t)

(setup (:pkg ein :straight t))
(setup (:pkg math-preview :straight t))
(setup (:pkg ipython-shell-send :straight t))

(setup (:pkg conda :straight t)
  :options
  (setq conda-anaconda-home (expand-file-name "~/anaconda3/"))
  (setq conda-env-home-directory (expand-file-name "~/anaconda3/"))
  (setq conda-env-subdirectory "envs"))

(unless (getenv "CONDA_DEFAULT_ENV")
  (conda-env-activate "base"))

(setup (:pkg ebuild-mode :straight t))
